# 4.9.1 Intro to Data Visualization with Python

# Contents List

### 01 Importing Libraries

Create Path

### 02 Import Data

Importing "orders_products_merged_updated_2"

Importing "customers.csv"

### 03 Wrangle Data

Renaming columns

Insights

### 04 Consistency and Quality Check

Checking for missing data

Finding missing first_name values

Addressing missing values by imputation

Checking duplicates

Converting mixed values

### 05 Merge Customer with prepared data

### 06 Export

Exporting as 'orders_products_customer_merged.pkl'

## 01 Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
# Path Import
path = r'/Users/carolinelasersohn/Documents/Documents - Carolineâ€™s MacBook Pro/data analytics/Immersion/4. Python/Instacart Basket Analysis 2023'

## 02 Importing Data

In [3]:
# df_merged import
df_merged = pd.read_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged_updated_2.pkl'))

In [4]:
# df_customer import
customer = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [5]:
customer.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [6]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [7]:
customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
customer.shape

(206209, 10)

## 03 Wrangle Data

### TO DO
- First Name to first_name
- suname to last_name
- Gender to gender
- STATE to state
- Age to age
- n_dependants to dependant_count

### INSIGHTS
- possibly could drop dependent_count (might be good idea to be able to see family size?)
- used_id can be used to join with df_merged

In [9]:
# rename columns
customer.rename(columns = {'First Name' : 'first_name'}, inplace = True)
customer.rename(columns = {'Surnam' : 'last_name'}, inplace = True)
customer.rename(columns = {'Gender' : 'gender'}, inplace = True)
customer.rename(columns = {'STATE' : 'state'}, inplace = True)
customer.rename(columns = {'Age' : 'age'}, inplace = True)
customer.rename(columns = {'n_dependants' : 'dependant_count'}, inplace = True)

In [10]:
# check
customer.head()

,user_id,first_name,last_name,gender,state,age,date_joined,dependant_count,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## 04 Consistency and Quality Check

### TO DO
- check for missing values
- address missing values
- check for duplicates
- address duplicates
- convert mixed-type data

### check for missing values

In [11]:
# check for missing values
customer.isnull().sum()

user_id                0
first_name         11259
last_name              0
gender                 0
state                  0
age                    0
date_joined            0
dependant_count        0
fam_status             0
income                 0
dtype: int64

missing first_name values

In [12]:
# find missing first_name values
customer.loc[customer['first_name'].isna()]

,user_id,first_name,last_name,gender,state,age,date_joined,dependant_count,fam_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [13]:
# address missing values by imputation
customer['first_name'].fillna('Unknown', inplace = True)

In [14]:
# check
customer.isnull().sum()

user_id            0
first_name         0
last_name          0
gender             0
state              0
age                0
date_joined        0
dependant_count    0
fam_status         0
income             0
dtype: int64

### check for duplicates

In [15]:
customer_dups = customer[customer.duplicated()]

In [16]:
customer_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, dependant_count, fam_status, income]
Index: []

no duplicates found

### convert mixed values

In [17]:
for col in customer.columns.tolist():
  weird = (customer[[col]].applymap(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customer[weird]) > 0:
    print (col)

no mixed values

## 05 Merge Customer with prepared data

In [18]:
df_merged.shape

(32404859, 25)

In [19]:
customer.shape

(206209, 10)

In [20]:
# merge on user_id
ords_prods_cust_merged = df_merged.merge(customer, on = ['user_id'])

In [21]:
ords_prods_cust_merged.head()

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,order_frequency_flag,first_name,last_name,gender,state,age,date_joined,dependant_count,fam_status,income
0,2539329,1,prior,1,2,8,0.0,196,1,0,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,prior,2,3,7,15.0,196,1,1,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,prior,3,3,12,21.0,196,1,1,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,prior,4,4,7,29.0,196,1,1,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,prior,5,4,15,28.0,196,1,1,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [22]:
ords_prods_cust_merged.shape

(32404859, 34)

## 06 Export to pickle

In [23]:
ords_prods_cust_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_customer_merged.pkl'))